//Дана действительная квадратная матрица порядка n. Найти наибольшее из 
//значений элементов, расположенных в заштрихованной части матрицы

void Start692b() {
	int n, i, j;
	float** matrix;

	printf("Введите n ");
	scanf_s("%d", &n);



	//for()
}